{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"5fd9a5cd-61ce-5641-9f64-1788e85dafdf","html":"<h2>Purpose and Goal</h2>\n<p>I decided to make QuickTV so I would have a quick way to see only new shows that were airing today or tomorrow. I typically have my shows set to record, but had recently made a switch to a new service and knew I wouldn't remember to set shows in the future. This was a good opportunity for me to not only practice vanilla ES6 JavaScript, but to have a place to go to quickly check on new shows coming out.</p>\n<h2>How it works</h2>\n<p>The app fetches from an API and stores the data in a couple of variables. All filtering is then done through the variables so we don't continually hit the API. Your local time zone is converted from GMT the API provides and then filters all of the shows into their respective air times. You can filter through show types as well as primetime or daytime and today or tomorrow airings.</p>","excerpt":"Purpose and Goal I decided to make QuickTV so I would have a quick way to see only new shows that were airing today or tomorrow. I typically…","frontmatter":{"title":"QuickTV","slug":"/quicktv","description":"App that shows a quick look at new TV episodes airing today and tomorrow.","image_desc":"QuickTV Demo","cloud_ref":"QuickTVDemo","media_type":"video","order":1}}},{"node":{"id":"c6622741-32ac-5ea2-94ec-35d93f8c5983","html":"<h2>Summary</h2>\n<p>Queue is a project I built while at a previous job. Most of the office used a certain website but we only had one login, so if one person was logged in working on the site and another person tried to login, it would knock off the first person causing lost data. I built this so everyone would know when someone was logged in and who was next in line.</p>\n<h2>Purpose and Goal</h2>\n<p>This was fun project to take on. I decided on React because I wanted to learn something new and thought the state management would come in handy. I went with Firebase because of its real time database which I was able to utilize to keep the front end updated with the current queue.</p>\n<h2>How it works</h2>\n<p>You login to the app with just a name and it saves to local storage. You then get placed into the queue which is handled through Firebase. Once it's your turn you'll get a notification and a link will pop up to login.</p>","excerpt":"Summary Queue is a project I built while at a previous job. Most of the office used a certain website but we only had one login, so if one…","frontmatter":{"title":"Queue","slug":"/queue","description":"App for queuing, notifies when you're up.","image_desc":"Queue Demo","cloud_ref":"QueueDemo","media_type":"video","order":2}}},{"node":{"id":"91b82775-a651-5748-9b93-8de5238eb095","html":"<h2>Purpose and Goal</h2>\n<p>After reading about Gatsby I thought that was the perfect framework for building out a small portfolio site, and it would allow me to learn something new in the process. One thing I really wanted to add into the site were page transitions. I had not used an animation framework before and decided on <a href=\"https://www.framer.com/motion/\">Framer Motion</a> for this project after hearing Scott Tolinski speak highly of it in an episode of the Syntax podcast. I also thought this would be a great opportunity to learn styled components as well, which it turns out I love!</p>","excerpt":"Purpose and Goal After reading about Gatsby I thought that was the perfect framework for building out a small portfolio site, and it would…","frontmatter":{"title":"Portfolio","slug":"/portfolio","description":"A portfolio for displaying my current and recent projects.","image_desc":"Portfolio Home Page","cloud_ref":"Portfolio","media_type":"image","order":3}}}],"totalCount":3}}}